#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "ru");
    int h1, m1, s1;
    int h2, m2, s2;
    int N, h, m, s;
    cout << "Введите начало промежутка времени(часы, минуты, секунды) через пробелы: ";
    cin >> h1 >> m1 >> s1;
    cout << "Введите конец промежутка времени(часы, минуты, секунды) через пробелы: ";
    cin >> h2 >> m2 >> s2;
    N = (h2 - h1) * 3600 + (m2 - m1) * 60 + (s2 - s1);
    h = (N / 3600);
    m = (N % 3600) / 60;
    s = (N % 3600) % 60;
    cout << "Продолжительность промежутка равна " << h << ':' << m << ':' << s << endl;
}
